---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ArchitecturalFloor
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ArchitecturalFloor

Creates a floor for the current level of the building model.